app/controllers/especialidads_controller.rb

  def index
    @especialidads = Especialidad.all
---
SELECT "especialidads".* FROM "especialidads"

  def show
      @medicos=@especialidad.medico.all
---
SELECT "medicos".* FROM "medicos" WHERE "medicos"."especialidad_id" = ?  [[nil, 1]]

  def create
    @especialidad = Especialidad.new(especialidad_params)

    respond_to do |format|
      if @especialidad.save
---
INSERT INTO "especialidads" ("nombreespe", "sala", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombreespe", "pintura"], ["sala", "3"], ["created_at", "2015-11-11 23:04:31.462765"], ["updated_at", "2015-11-11 23:04:31.462765"]]

  def update
    respond_to do |format|
      if @especialidad.update(especialidad_params)
---
UPDATE "especialidads" SET "nombreespe" = ?, "updated_at" = ? WHERE "especialidads"."id" = ?  [["nombreespe", "pediatria"], ["updated_at", "2015-11-23 16:19:57.338613"], ["id", 1]]

    def set_especialidad
      @especialidad = Especialidad.find(params[:id])
---
SELECT  "especialidads".* FROM "especialidads" WHERE "especialidads"."id" = ? LIMIT 1  [["id", 1]]