app/controllers/medicos_controller.rb

  def index
    @medicos = Medico.all
---
SELECT "medicos".* FROM "medicos"

  def show
    @pacientes = @medico.paciente.all
---
SELECT "pacientes".* FROM "pacientes" INNER JOIN "medico_pacientes" ON "pacientes"."id" = "medico_pacientes"."paciente_id" WHERE "medico_pacientes"."medico_id" = ?  [["medico_id", 1]]

  def create
    @medico = Medico.new(medico_params)

    respond_to do |format|
      if @medico.save
---
INSERT INTO "medicos" ("nombremedico", "apemedico", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombremedico", "sergio "], ["apemedico", "gonzalez"], ["created_at", "2015-11-10 23:48:45.706153"], ["updated_at", "2015-11-10 23:48:45.706153"]]

  def update
    respond_to do |format|
      if @medico.update(medico_params)
---
UPDATE "medicos" SET "apemedico" = ?, "updated_at" = ? WHERE "medicos"."id" = ?  [["apemedico", "gonzalez v"], ["updated_at", "2015-11-11 22:16:23.566032"], ["id", 1]]

  def destroy
    @medico.destroy
---
DELETE FROM "medicos" WHERE "medicos"."id" = ?  [["id", 3]]

    def set_medico
      @medico = Medico.find(params[:id])
---
SELECT  "medicos".* FROM "medicos" WHERE "medicos"."id" = ? LIMIT 1  [["id", 3]]