app/controllers/medico_pacientes_controller.rb

  def index
    @medico_pacientes = MedicoPaciente.all
---
SELECT "medico_pacientes".* FROM "medico_pacientes"

  def create
    @medico_paciente = MedicoPaciente.new(medico_paciente_params)

    respond_to do |format|
      if @medico_paciente.save
---
INSERT INTO "medico_pacientes" ("medico_id", "paciente_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["medico_id", 0], ["paciente_id", 0], ["created_at", "2015-11-10 23:53:58.652048"], ["updated_at", "2015-11-10 23:53:58.652048"]]

  def update
    respond_to do |format|
      if @medico_paciente.update(medico_paciente_params)
---
UPDATE "medico_pacientes" SET "paciente_id" = ?, "updated_at" = ? WHERE "medico_pacientes"."id" = ?  [["paciente_id", 3], ["updated_at", "2015-11-11 22:49:04.870537"], ["id", 12]]

  def destroy
    @medico_paciente.destroy
---
DELETE FROM "medico_pacientes" WHERE "medico_pacientes"."id" = ?  [["id", 1]]

    def set_medico_paciente
      @medico_paciente = MedicoPaciente.find(params[:id])
---
SELECT  "medico_pacientes".* FROM "medico_pacientes" WHERE "medico_pacientes"."id" = ? LIMIT 1  [["id", 12]]
SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT 1  [["id", 3]]