app/controllers/pacientes_controller.rb

  def index
    @pacientes = Paciente.all
---
SELECT "pacientes".* FROM "pacientes"

  def show
    @medicos = @paciente.medico.all
---
SELECT "medicos".* FROM "medicos" INNER JOIN "medico_pacientes" ON "medicos"."id" = "medico_pacientes"."medico_id" WHERE "medico_pacientes"."paciente_id" = ?  [["paciente_id", 1]]

  def create
    @paciente = Paciente.new(paciente_params)

    respond_to do |format|
      if @paciente.save
---
INSERT INTO "pacientes" ("nombrepaciente", "apepaciente", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["nombrepaciente", "ernesto"], ["apepaciente", "gonzalez"], ["created_at", "2015-11-10 23:49:07.246942"], ["updated_at", "2015-11-10 23:49:07.246942"]]

  def update
    respond_to do |format|
      if @paciente.update(paciente_params)
---
UPDATE "pacientes" SET "apepaciente" = ?, "updated_at" = ? WHERE "pacientes"."id" = ?  [["apepaciente", "gonzalez v"], ["updated_at", "2015-11-11 22:36:19.624357"], ["id", 1]]

  def destroy
    @paciente.destroy
---
DELETE FROM "pacientes" WHERE "pacientes"."id" = ?  [["id", 2]]

    def set_paciente
      @paciente = Paciente.find(params[:id])
---
SELECT  "pacientes".* FROM "pacientes" WHERE "pacientes"."id" = ? LIMIT 1  [["id", 2]]